<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"1430a7666751179cf23982a8cfd8158fdaaaea293a9a8e300dc9bc0473e3fa8d","plan_job_ref":"Job Pull Request Checks #226 at https://github.com/GSA-TTS/FAC/actions/runs/5738723398","plan_hash":"67d4da82475c32c45ae4cddec0ce8f528234697f05ebd7dcf18e544679c9af46","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 3 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.domain.data.cloudfoundry_app.app will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_app" "app" {
      + buildpack                  = (known after apply)
      + command                    = (known after apply)
      + disk_quota                 = (known after apply)
      + enable_ssh                 = (known after apply)
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = (known after apply)
      + id                         = (known after apply)
      + instances                  = (known after apply)
      + memory                     = (known after apply)
      + name                       = (known after apply)
      + name_or_id                 = "*******"
      + space                      = (known after apply)
      + stack                      = (known after apply)
      + state                      = (known after apply)
    }

  # module.domain.data.cloudfoundry_domain.origin_url will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "origin_url" {
      + domain   = (known after apply)
      + id       = (known after apply)
      + internal = (known after apply)
      + name     = "fac.gov"
      + org      = (known after apply)
    }

  # module.domain.data.cloudfoundry_service.external_domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service" "external_domain" {
      + id                  = (known after apply)
      + name                = "external-domain"
      + service_broker_name = (known after apply)
      + service_plans       = (known after apply)
    }

  # module.domain.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
      + id       = (known after apply)
      + name     = "production"
      + org      = (known after apply)
      + org_name = "gsa-tts-oros-fac"
      + quota    = (known after apply)
    }

  # module.domain.cloudfoundry_route.origin_route must be replaced
-/+ resource "cloudfoundry_route" "origin_route" {
      ~ domain   = "559e0623-9057-45ef-a9ca-e183df56b4e3" # forces replacement -> (known after apply) # forces replacement
      ~ endpoint = "app.fac.gov" -> (known after apply)
      ~ id       = "************************************" -> (known after apply)
      + port     = (known after apply)
      ~ space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      - target {
          - app  = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
          - port = 0 -> null
        }
      + target {
          + app  = (known after apply)
          + port = (known after apply)
        }
    }

  # module.domain.cloudfoundry_service_instance.external_domain_instance must be replaced
-/+ resource "cloudfoundry_service_instance" "external_domain_instance" {
      ~ id                             = "************************************" -> (known after apply)
      ~ name                           = "gsa-fac-fac.gov" -> (known after apply)
      ~ service_plan                   = "7c5ed2a5-6734-455f-b1b9-4eaa55f638b3" -> (known after apply)
      ~ space                          = "5593dba8-7023-49a5-bdbe-e809fe23edf9" # forces replacement -> (known after apply) # forces replacement
      - tags                           = [] -> null
        # (4 unchanged attributes hidden)
    }

  # module.production.cloudfoundry_app.postgrest will be updated in-place
  ~ resource "cloudfoundry_app" "postgrest" {
      ~ docker_image                    = "ghcr.io/gsa-tts/fac/postgrest:1679777086" -> "ghcr.io/gsa-tts/fac/postgrest@sha256:53acdb91a92d31d17020b6f60dc34ba47c454827cb59f814ede01fb539754247"
      ~ environment                     = (sensitive value)
        id                              = "47624daf-e299-4162-85a1-a869141409f0"
      ~ id_bg                           = "************************************" -> (known after apply)
        name                            = "postgrest"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
  ~ resource "cloudfoundry_app" "clamav_api" {
      ~ docker_image                    = "ajilaag/clamav-rest:20230228" -> "ghcr.io/gsa-tts/fac/clamav@sha256:0f54c4b052f7dfdc2a0c5ef28bcada6c296882932859e29588818b9644e00412"
        id                              = "5d0afa4f-527b-472a-8671-79a60335417f"
        name                            = "fac-av-production"
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
  ~ resource "cloudfoundry_app" "egress_app" {
        id                              = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
        name                            = "https-proxy"
      ~ source_code_hash                = "48b2f5eba8d1f35c0fbc2f90c2ec87cab180f5f19e7e34b16b9190fe5c5ca09a" -> "9fcf4a7f6abfc9a220de2b8bb97591ab490a271ac0933b984f606f645319e1a4"
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #226](https://github.com/GSA-TTS/FAC/actions/runs/5738723398)